{
  "data": [
    {
      "node": {
        "id": 24833,
        "title": "Ansatsu Kyoushitsu",
        "main_picture": {
          "medium": "https://cdn.myanimelist.net/images/anime/5/75639.jpg",
          "large": "https://cdn.myanimelist.net/images/anime/5/75639l.jpg"
        },
        "alternative_titles": {
          "synonyms": [],
          "en": "Assassination Classroom",
          "ja": "暗殺教室"
        },
        "start_date": "2015-01-10",
        "end_date": "2015-06-20",
        "synopsis": "Tucked in the mountains near the elite Kunugigaoka Middle School lies a small derelict building that houses the delinquents and dropouts of Class 3-E. Looked down upon by their peers, the students in this class appear to have little hope in advancing their academic careers. That is, until the national government tasks them with eliminating the greatest threat to their planet: their new teacher. \n\nHaving already destroyed the moon, the octopus-like professor—dubbed \"Koro-sensei\"—has now threatened to destroy the Earth by March of the following year. In light of their mission, the students have found that killing him is easier said than done. Not only can Koro-sensei move at speeds of up to Mach 20, but he can also resist almost every earthly weapon. Ironically, he also proves to be one of the best teachers Class 3-E has ever had. Training the class to excel in both their studies as students and skills as assassins, Koro-sensei is confident that his students' ingenuity and indomitable will could return them to the main campus. \n\nThrough trial and error, Nagisa Shiota, as well as the other students of Class 3-E, must figure out Koro-sensei's weaknesses—and fast, for the very fate of the world depends upon it.\n\n[Written by MAL Rewrite]\n",
        "mean": 8.07,
        "rank": 605,
        "popularity": 33,
        "num_episodes": 22,
        "status": "finished_airing",
        "genres": [
          {
            "id": 1,
            "name": "Action"
          },
          {
            "id": 4,
            "name": "Comedy"
          },
          {
            "id": 23,
            "name": "School"
          },
          {
            "id": 27,
            "name": "Shounen"
          }
        ],
        "media_type": "tv",
        "rating": "pg_13",
        "my_list_status": {
          "status": "completed",
          "score": 7,
          "num_episodes_watched": 22,
          "is_rewatching": false,
          "updated_at": "2025-01-04T06:57:05+00:00",
          "tags": [],
          "comments": ""
        }
      }
    },
    {
      "node": {
        "id": 20787,
        "title": "Black Bullet",
        "main_picture": {
          "medium": "https://cdn.myanimelist.net/images/anime/1292/94693.webp",
          "large": "https://cdn.myanimelist.net/images/anime/1292/94693l.webp"
        },
        "alternative_titles": {
          "synonyms": [],
          "en": "Black Bullet",
          "ja": "ブラック・ブレット　BLACK BULLET　［黒の銃弾］"
        },
        "start_date": "2014-04-08",
        "end_date": "2014-07-01",
        "synopsis": "In the year 2021, a parasitic virus known as \"Gastrea\" infects humans and turns them into monsters. What is left of mankind now lives within the Monolith walls, walls that are made of Varanium, the only material that can hurt Gastrea.\n\nTo counter the threat that the Gastrea pose, \"Cursed Children\"—female children whose bodies contain trace amounts of the virus which grant them superhuman abilities—officially called Initiators by the Tendo Civil Security, are given partners called Promoters, people who work to guide and protect the young Initiators. These teams of two are sent out on missions to fight the monsters created by the Gastrea virus and keep them at bay. \n\nBlack Bullet revolves around the team of Enju Aihara, an Initiator, and Satomi Rentaro, a Promoter, as they go on missions to fight the growing threat of Gastrea in their hometown of Tokyo.\n\n[Written by MAL Rewrite]",
        "mean": 7.07,
        "rank": 4248,
        "popularity": 198,
        "num_episodes": 13,
        "status": "finished_airing",
        "genres": [
          {
            "id": 1,
            "name": "Action"
          },
          {
            "id": 7,
            "name": "Mystery"
          },
          {
            "id": 24,
            "name": "Sci-Fi"
          }
        ],
        "media_type": "tv",
        "rating": "r",
        "my_list_status": {
          "status": "completed",
          "score": 8,
          "num_episodes_watched": 13,
          "is_rewatching": false,
          "updated_at": "2025-10-17T22:46:20+00:00",
          "tags": [],
          "comments": ""
        }
      }
    },
    {
      "node": {
        "id": 34618,
        "title": "Blend S",
        "main_picture": {
          "medium": "https://cdn.myanimelist.net/images/anime/6/88286.jpg",
          "large": "https://cdn.myanimelist.net/images/anime/6/88286l.jpg"
        },
        "alternative_titles": {
          "synonyms": [],
          "en": "BLEND-S",
          "ja": "ブレンド・S"
        },
        "start_date": "2017-10-08",
        "end_date": "2017-12-24",
        "synopsis": "Wishing to be independent, 16-year-old Maika Sakuranomiya is desperate to nail down a part-time job so that she can afford to study abroad. Unfortunately, her applications are constantly rejected due to the menacing look she unintentionally makes whenever she smiles, despite her otherwise cheerful disposition.\n\nAfter yet another failed interview, she chances upon Café Stile, a coffee shop where the servers interact with the customers while roleplaying distinctive characteristics. The Italian store manager, Dino, becomes infatuated with Maika's cuteness at first sight, and offers her a job as a waitress with a sadistic nature. Coupled with her inherent clumsiness, she successfully manages to serve a pair of masochistic customers in accordance with her new, ruthless persona. Alongside Kaho Hinata as the tsundere and Mafuyu Hoshikawa as the younger sister, Maika decides to make the most out of her unique quirk and cements her position in the cafe with merciless cruelty!\n\n[Written by MAL Rewrite]",
        "mean": 7.24,
        "rank": 3304,
        "popularity": 336,
        "num_episodes": 12,
        "status": "finished_airing",
        "genres": [
          {
            "id": 4,
            "name": "Comedy"
          },
          {
            "id": 69,
            "name": "Otaku Culture"
          },
          {
            "id": 48,
            "name": "Workplace"
          }
        ],
        "media_type": "tv",
        "rating": "pg_13",
        "my_list_status": {
          "status": "completed",
          "score": 8,
          "num_episodes_watched": 12,
          "is_rewatching": false,
          "updated_at": "2025-01-04T06:41:06+00:00",
          "tags": [],
          "comments": ""
        }
      }
    },
    {
      "node": {
        "id": 31964,
        "title": "Boku no Hero Academia",
        "main_picture": {
          "medium": "https://cdn.myanimelist.net/images/anime/10/78745.webp",
          "large": "https://cdn.myanimelist.net/images/anime/10/78745l.webp"
        },
        "alternative_titles": {
          "synonyms": [],
          "en": "My Hero Academia",
          "ja": "僕のヒーローアカデミア"
        },
        "start_date": "2016-04-03",
        "end_date": "2016-06-26",
        "synopsis": "The appearance of \"quirks,\" newly discovered super powers, has been steadily increasing over the years, with 80 percent of humanity possessing various abilities from manipulation of elements to shapeshifting. This leaves the remainder of the world completely powerless, and Izuku Midoriya is one such individual.\n\nSince he was a child, the ambitious middle schooler has wanted nothing more than to be a hero. Izuku's unfair fate leaves him admiring heroes and taking notes on them whenever he can. But it seems that his persistence has borne some fruit: Izuku meets the number one hero and his personal idol, All Might. All Might's quirk is a unique ability that can be inherited, and he has chosen Izuku to be his successor!\n\nEnduring many months of grueling training, Izuku enrolls in UA High, a prestigious high school famous for its excellent hero training program, and this year's freshmen look especially promising. With his bizarre but talented classmates and the looming threat of a villainous organization, Izuku will soon learn what it really means to be a hero.\n\n[Written by MAL Rewrite]",
        "mean": 7.83,
        "rank": 1049,
        "popularity": 7,
        "num_episodes": 13,
        "status": "finished_airing",
        "genres": [
          {
            "id": 1,
            "name": "Action"
          },
          {
            "id": 23,
            "name": "School"
          },
          {
            "id": 27,
            "name": "Shounen"
          },
          {
            "id": 31,
            "name": "Super Power"
          }
        ],
        "media_type": "tv",
        "rating": "pg_13",
        "my_list_status": {
          "status": "completed",
          "score": 6,
          "num_episodes_watched": 13,
          "is_rewatching": false,
          "updated_at": "2025-01-04T06:57:56+00:00",
          "tags": [],
          "comments": ""
        }
      }
    },
    {
      "node": {
        "id": 33486,
        "title": "Boku no Hero Academia 2nd Season",
        "main_picture": {
          "medium": "https://cdn.myanimelist.net/images/anime/12/85221.jpg",
          "large": "https://cdn.myanimelist.net/images/anime/12/85221l.jpg"
        },
        "alternative_titles": {
          "synonyms": [],
          "en": "My Hero Academia Season 2",
          "ja": "僕のヒーローアカデミア"
        },
        "start_date": "2017-04-01",
        "end_date": "2017-09-30",
        "synopsis": "At UA Academy, not even a violent attack can disrupt their most prestigious event: the school sports festival. Renowned across Japan, this festival is an opportunity for aspiring heroes to showcase their abilities, both to the public and potential recruiters.\n\nHowever, the path to glory is never easy, especially for Izuku Midoriya—whose quirk possesses great raw power but is also cripplingly inefficient. Pitted against his talented classmates, such as the fire and ice wielding Shouto Todoroki, Izuku must utilize his sharp wits and master his surroundings to achieve victory and prove to the world his worth.\n\n[Written by MAL Rewrite]",
        "mean": 8.05,
        "rank": 640,
        "popularity": 16,
        "num_episodes": 25,
        "status": "finished_airing",
        "genres": [
          {
            "id": 1,
            "name": "Action"
          },
          {
            "id": 23,
            "name": "School"
          },
          {
            "id": 27,
            "name": "Shounen"
          },
          {
            "id": 31,
            "name": "Super Power"
          }
        ],
        "media_type": "tv",
        "rating": "pg_13",
        "my_list_status": {
          "status": "completed",
          "score": 7,
          "num_episodes_watched": 25,
          "is_rewatching": false,
          "updated_at": "2025-10-17T22:38:49+00:00",
          "tags": [],
          "comments": ""
        }
      }
    },
    {
      "node": {
        "id": 36456,
        "title": "Boku no Hero Academia 3rd Season",
        "main_picture": {
          "medium": "https://cdn.myanimelist.net/images/anime/1319/92084.jpg",
          "large": "https://cdn.myanimelist.net/images/anime/1319/92084l.jpg"
        },
        "alternative_titles": {
          "synonyms": [],
          "en": "My Hero Academia Season 3",
          "ja": "僕のヒーローアカデミア"
        },
        "start_date": "2018-04-07",
        "end_date": "2018-09-29",
        "synopsis": "As summer arrives for the students at UA Academy, each of these superheroes-in-training puts in their best efforts to become renowned heroes. They head off to a forest training camp run by UA's pro heroes, where the students face one another in battle and go through dangerous tests, improving their abilities and pushing past their limits. However, their school trip is suddenly turned upside down when the League of Villains arrives, invading the camp with a mission to capture one of the students. \n\nBoku no Hero Academia 3rd Season follows Izuku \"Deku\" Midoriya, an ambitious student training to achieve his dream of becoming a hero similar to his role model—All Might. Being one of the students caught up amidst the chaos of the villain attack, Deku must take a stand with his classmates and fight for their survival.\n\n[Written by MAL Rewrite]",
        "mean": 7.98,
        "rank": 748,
        "popularity": 25,
        "num_episodes": 25,
        "status": "finished_airing",
        "genres": [
          {
            "id": 1,
            "name": "Action"
          },
          {
            "id": 23,
            "name": "School"
          },
          {
            "id": 27,
            "name": "Shounen"
          },
          {
            "id": 31,
            "name": "Super Power"
          }
        ],
        "media_type": "tv",
        "rating": "pg_13",
        "my_list_status": {
          "status": "completed",
          "score": 10,
          "num_episodes_watched": 25,
          "is_rewatching": false,
          "updated_at": "2025-01-04T06:58:25+00:00",
          "tags": [],
          "comments": ""
        }
      }
    },
    {
      "node": {
        "id": 38408,
        "title": "Boku no Hero Academia 4th Season",
        "main_picture": {
          "medium": "https://cdn.myanimelist.net/images/anime/1412/107914.jpg",
          "large": "https://cdn.myanimelist.net/images/anime/1412/107914l.jpg"
        },
        "alternative_titles": {
          "synonyms": [],
          "en": "My Hero Academia Season 4",
          "ja": "僕のヒーローアカデミア"
        },
        "start_date": "2019-10-12",
        "end_date": "2020-04-04",
        "synopsis": "After successfully passing his Provisional Hero License exam, Izuku \"Deku\" Midoriya seeks out an extracurricular internship with a professional hero agency. At the recommendation of his mentor All Might, Midoriya lands a position under All Might's former sidekick, Sir Nighteye, now a famous hero in his own right.\n\nAs Midoriya's classmates further their own abilities through various internships, up-and-coming villain Kai Chisaki utilizes his terrifying powers to gather favor in the criminal underworld. Known by the moniker Overhaul, Chisaki's ambitions collide with the League of Villains and its leader, Tomura Shigaraki.\n\nThrough his work with Sir Nighteye, Midoriya discovers Chisaki's crime syndicate and the villain's hostile relationship with a mysterious young girl named Eri. Fearing for the child's safety, Midoriya and his upperclassman Mirio Toogata must work together to put an end to Chisaki's reign of terror.\n\n[Written by MAL Rewrite]",
        "mean": 7.86,
        "rank": 986,
        "popularity": 54,
        "num_episodes": 25,
        "status": "finished_airing",
        "genres": [
          {
            "id": 1,
            "name": "Action"
          },
          {
            "id": 23,
            "name": "School"
          },
          {
            "id": 27,
            "name": "Shounen"
          },
          {
            "id": 31,
            "name": "Super Power"
          }
        ],
        "media_type": "tv",
        "rating": "pg_13",
        "my_list_status": {
          "status": "completed",
          "score": 9,
          "num_episodes_watched": 25,
          "is_rewatching": false,
          "updated_at": "2025-01-04T06:58:41+00:00",
          "tags": [],
          "comments": ""
        }
      }
    },
    {
      "node": {
        "id": 41587,
        "title": "Boku no Hero Academia 5th Season",
        "main_picture": {
          "medium": "https://cdn.myanimelist.net/images/anime/1911/113611.jpg",
          "large": "https://cdn.myanimelist.net/images/anime/1911/113611l.jpg"
        },
        "alternative_titles": {
          "synonyms": ["My Hero Academia 5"],
          "en": "My Hero Academia Season 5",
          "ja": "僕のヒーローアカデミア"
        },
        "start_date": "2021-03-27",
        "end_date": "2021-09-25",
        "synopsis": "UA Academy's Class 1-A has been the focus of a substantial amount of public attention due to the multiple villain attacks they have faced over the past school year. This attention has left Class 1-A's rivals, Class 1-B, feeling quite bitter. Desiring to prove their skills, they look forward to the opportunity that has been given to them: a set of mock battles between the students of each class.\n\nThe classes are split into squads of four, each of which is tasked with capturing the other group members. The winner is the group who first secures all of the opposing team. While this sounds simple, a curveball is thrown into the mix with the inclusion of General Course Student Hitoshi Shinsou, who wishes to transfer into the Hero Course. Despite using his training with Class 1-A's homeroom teacher Shouta \"Eraserhead\" Aizawa to prove that he's capable of being a real hero, he is still far behind the others due to his lack of experience. However, Shinsou is determined to overcome this challenge.\n\nThus begins the fiery competition between Class 1-A and 1-B as each tries to prove that they are superior to the other.\n\n[Written by MAL Rewrite]",
        "mean": 7.35,
        "rank": 2745,
        "popularity": 110,
        "num_episodes": 25,
        "status": "finished_airing",
        "genres": [
          {
            "id": 1,
            "name": "Action"
          },
          {
            "id": 23,
            "name": "School"
          },
          {
            "id": 27,
            "name": "Shounen"
          },
          {
            "id": 31,
            "name": "Super Power"
          }
        ],
        "media_type": "tv",
        "rating": "pg_13",
        "my_list_status": {
          "status": "completed",
          "score": 8,
          "num_episodes_watched": 25,
          "is_rewatching": false,
          "updated_at": "2025-01-04T06:58:59+00:00",
          "tags": [],
          "comments": ""
        }
      }
    },
    {
      "node": {
        "id": 36896,
        "title": "Boku no Hero Academia the Movie 1: Futari no Hero",
        "main_picture": {
          "medium": "https://cdn.myanimelist.net/images/anime/1736/93138.webp",
          "large": "https://cdn.myanimelist.net/images/anime/1736/93138l.webp"
        },
        "alternative_titles": {
          "synonyms": ["My Hero Academia the Movie: The Two Heroes"],
          "en": "My Hero Academia: Two Heroes",
          "ja": "僕のヒーローアカデミア THE MOVIE ～2人の英雄（ヒーロー）～"
        },
        "start_date": "2018-08-03",
        "end_date": "2018-08-03",
        "synopsis": "U.A. High School's students of Class 1-A have made it to summer break. Izuku Midoriya accompanies his mentor All Might to a celebratory superhero festival on I-Island, an isolated patch of land dedicated to researching Quirks and everything else associated with the hero business. Midoriya is granted the opportunity to meet All Might's friend Dave and Dave's daughter Melissa, two talented hero equipment engineers. He also encounters his classmates, most of whom have been given the opportunity to spend part of their summer break at the festival.\n\nHowever, a mysterious squad of villains infiltrates I-Island, and it is up to Midoriya and his friends to confront them, using their developing Quirks to fight off the new enemy and uncover a treacherous plot.\n\n[Written by MAL Rewrite]",
        "mean": 7.52,
        "rank": 1984,
        "popularity": 274,
        "num_episodes": 1,
        "status": "finished_airing",
        "genres": [
          {
            "id": 1,
            "name": "Action"
          },
          {
            "id": 27,
            "name": "Shounen"
          },
          {
            "id": 31,
            "name": "Super Power"
          }
        ],
        "media_type": "movie",
        "rating": "pg_13",
        "my_list_status": {
          "status": "completed",
          "score": 7,
          "num_episodes_watched": 1,
          "is_rewatching": false,
          "updated_at": "2025-01-04T06:59:39+00:00",
          "tags": [],
          "comments": ""
        }
      }
    },
    {
      "node": {
        "id": 39565,
        "title": "Boku no Hero Academia the Movie 2: Heroes:Rising",
        "main_picture": {
          "medium": "https://cdn.myanimelist.net/images/anime/1019/103292.jpg",
          "large": "https://cdn.myanimelist.net/images/anime/1019/103292l.jpg"
        },
        "alternative_titles": {
          "synonyms": ["My Hero Academia the Movie 2: Heroes:Rising"],
          "en": "My Hero Academia: Heroes Rising",
          "ja": "僕のヒーローアカデミア THE MOVIE　ヒーローズ：ライジング"
        },
        "start_date": "2019-12-20",
        "end_date": "2019-12-20",
        "synopsis": "Izuku \"Deku'' Midoriya and his fellow students in Class 1-A of UA High's hero course have been chosen to participate in a safety program on Nabu Island. To further improve their skills and gain experience in more ordinary heroics, the students aid the kind citizens with small services and everyday chores. With the low crime rate in the quiet community, all seems well and good, but the rise of a new villain threatens to put the students' courage to the test and challenge their capabilities as heroes.\n\nA merciless villain by the name of Nine is in search of a certain \"quirk\" needed to fulfill his diabolical plan—creating a society where only those with the strongest quirks reign supreme. As his attack on Nabu Island endangers the lives of the residents, securing the citizens becomes the first priority for Class 1-A; defeating Nine along with his wicked accomplices is also imperative. A straightforward strategy is formulated until a young boy named Katsuma Shimano, whom Deku had befriended, suddenly requires particular protection. Concerned for the boy's wellbeing, Deku and his classmates must now devise a plan to ensure Katsuma's safety at all costs.\n\nWith Nine wreaking havoc to find the catalyst for his ill-intended schemes and the heroes desperate to defend Katsuma from harm, will Deku and his friends be able to come out victorious, or will they find themselves unable to escape a hopeless situation?\n\n[Written by MAL Rewrite]",
        "mean": 7.93,
        "rank": 823,
        "popularity": 389,
        "num_episodes": 1,
        "status": "finished_airing",
        "genres": [
          {
            "id": 1,
            "name": "Action"
          },
          {
            "id": 27,
            "name": "Shounen"
          },
          {
            "id": 31,
            "name": "Super Power"
          }
        ],
        "media_type": "movie",
        "rating": "pg_13",
        "my_list_status": {
          "status": "completed",
          "score": 7,
          "num_episodes_watched": 1,
          "is_rewatching": false,
          "updated_at": "2025-01-04T06:59:58+00:00",
          "tags": [],
          "comments": ""
        }
      }
    },
    {
      "node": {
        "id": 42310,
        "title": "Cyberpunk: Edgerunners",
        "main_picture": {
          "medium": "https://cdn.myanimelist.net/images/anime/1818/126435.jpg",
          "large": "https://cdn.myanimelist.net/images/anime/1818/126435l.jpg"
        },
        "alternative_titles": {
          "synonyms": [],
          "en": "",
          "ja": "サイバーパンク エッジランナーズ"
        },
        "start_date": "2022-09-13",
        "end_date": "2022-09-13",
        "synopsis": "Dreams are doomed to die in Night City, a futuristic Californian metropolis. As a teenager living in the city's slums, David Martinez is trying to fulfill his mother's lifelong wish for him to reach the top of Arasaka, the world's leading security corporation. To this end, he attends the prestigious Arasaka Academy while his mother works tirelessly to keep their family afloat.\n\nWhen an incident with a street gang leaves David's life in tatters, he stumbles upon Sandevistan cyberware—a prosthetic that grants its wearer superhuman speed. Fueled by rage, David implants the device in his back, using it to exact revenge on one of his tormentors. This gets him expelled from the academy, shattering his hopes of ever making his mother proud.\n\nAfter witnessing David's newfound abilities, the beautiful data thief Lucyna \"Lucy\" Kushinada offers to team up with him, handing him a ticket to salvation. However, associating with Lucy introduces David to the world of Edgerunners—cyborg criminals who will break any law for money. Edgerunners often lose their lives, if the cyberware does not break their minds first; but in his fight for survival inside a corrupt system, David is ready to risk it all.\n\n[Written by MAL Rewrite]",
        "mean": 8.62,
        "rank": 96,
        "popularity": 181,
        "num_episodes": 10,
        "status": "finished_airing",
        "genres": [
          {
            "id": 1,
            "name": "Action"
          },
          {
            "id": 58,
            "name": "Gore"
          },
          {
            "id": 68,
            "name": "Organized Crime"
          },
          {
            "id": 24,
            "name": "Sci-Fi"
          }
        ],
        "media_type": "ona",
        "rating": "r+",
        "my_list_status": {
          "status": "completed",
          "score": 10,
          "num_episodes_watched": 10,
          "is_rewatching": false,
          "updated_at": "2025-01-04T06:32:38+00:00",
          "tags": [],
          "comments": ""
        }
      }
    },
    {
      "node": {
        "id": 6033,
        "title": "Dragon Ball Kai",
        "main_picture": {
          "medium": "https://cdn.myanimelist.net/images/anime/1102/133990.webp",
          "large": "https://cdn.myanimelist.net/images/anime/1102/133990l.webp"
        },
        "alternative_titles": {
          "synonyms": ["Dragonball Kai", "DBK", "DB Kai", "DBZ Kai"],
          "en": "Dragon Ball Z Kai",
          "ja": "ドラゴンボール改"
        },
        "start_date": "2009-04-05",
        "end_date": "2011-03-27",
        "synopsis": "Five years after the events of Dragon Ball, martial arts expert Gokuu is now a grown man married to his wife Chi-Chi, with a four-year old son named Gohan. While attending a reunion on Turtle Island with his old friends Master Roshi, Krillin, Bulma and others, the festivities are interrupted when a humanoid alien named Raditz not only reveals the truth behind Gokuu's past, but kidnaps Gohan as well.\n\nWith Raditz displaying power beyond anything Gokuu has seen before, he is forced to team up with his old nemesis, Piccolo, in order to rescue his son. But when Gokuu and Piccolo reveal the secret of the seven mystical wish-granting Dragon Balls to Raditz, he informs the duo that there is more of his race, the Saiyans, and they won’t pass up an opportunity to seize the power of the Dragon Balls for themselves.\n\nThese events begin the saga of Dragon Ball Kai, a story that finds Gokuu and his friends and family constantly defending the galaxy from increasingly more powerful threats. Bizarre, comical, heartwarming and threatening characters come together in a series of battles that push the powers and abilities of Gokuu and his friends beyond anything they have ever experienced.",
        "mean": 7.78,
        "rank": 1161,
        "popularity": 611,
        "num_episodes": 97,
        "status": "finished_airing",
        "genres": [
          {
            "id": 1,
            "name": "Action"
          },
          {
            "id": 2,
            "name": "Adventure"
          },
          {
            "id": 4,
            "name": "Comedy"
          },
          {
            "id": 10,
            "name": "Fantasy"
          },
          {
            "id": 17,
            "name": "Martial Arts"
          },
          {
            "id": 27,
            "name": "Shounen"
          }
        ],
        "media_type": "tv",
        "rating": "pg_13",
        "my_list_status": {
          "status": "completed",
          "score": 7,
          "num_episodes_watched": 97,
          "is_rewatching": false,
          "updated_at": "2025-01-04T06:41:50+00:00",
          "tags": [],
          "comments": ""
        }
      }
    },
    {
      "node": {
        "id": 30694,
        "title": "Dragon Ball Super",
        "main_picture": {
          "medium": "https://cdn.myanimelist.net/images/anime/7/74606.webp",
          "large": "https://cdn.myanimelist.net/images/anime/7/74606l.webp"
        },
        "alternative_titles": {
          "synonyms": ["Dragon Ball Chou", "DB Super", "DBS"],
          "en": "Dragon Ball Super",
          "ja": "ドラゴンボール超（スーパー）"
        },
        "start_date": "2015-07-05",
        "end_date": "2018-03-25",
        "synopsis": "Seven years after the defeat of Majin Buu, Earth is at peace, and its people live free from any dangers lurking in the universe. However, this peace is short-lived; a sleeping threat awakens in the dark reaches of the galaxy: Beerus, the ruthless God of Destruction.\n\nDisturbed by a prophecy that he will be defeated by a \"Super Saiyan God,\" Beerus and his angelic attendant Whis search the universe for this mysterious being. Before long, they reach Earth and encounter Gokuu Son, one of the planet's mightiest warriors, and his powerful friends.\n\n[Written by MAL Rewrite]",
        "mean": 7.47,
        "rank": 2214,
        "popularity": 222,
        "num_episodes": 131,
        "status": "finished_airing",
        "genres": [
          {
            "id": 1,
            "name": "Action"
          },
          {
            "id": 2,
            "name": "Adventure"
          },
          {
            "id": 4,
            "name": "Comedy"
          },
          {
            "id": 10,
            "name": "Fantasy"
          },
          {
            "id": 17,
            "name": "Martial Arts"
          },
          {
            "id": 27,
            "name": "Shounen"
          }
        ],
        "media_type": "tv",
        "rating": "pg_13",
        "my_list_status": {
          "status": "completed",
          "score": 7,
          "num_episodes_watched": 131,
          "is_rewatching": false,
          "updated_at": "2025-01-04T06:30:37+00:00",
          "tags": [],
          "comments": ""
        }
      }
    },
    {
      "node": {
        "id": 36946,
        "title": "Dragon Ball Super: Broly",
        "main_picture": {
          "medium": "https://cdn.myanimelist.net/images/anime/1575/93498.webp",
          "large": "https://cdn.myanimelist.net/images/anime/1575/93498l.webp"
        },
        "alternative_titles": {
          "synonyms": [],
          "en": "Dragon Ball Super: Broly",
          "ja": "ドラゴンボール超（スーパー） ブロリー"
        },
        "start_date": "2018-12-14",
        "end_date": "2018-12-14",
        "synopsis": "Forty-one years ago on Planet Vegeta, home of the infamous Saiyan warrior race, King Vegeta noticed a baby named Broly whose latent power exceeded that of his own son. Believing that Broly's power would one day surpass that of his child, Vegeta, the king sends Broly to the desolate planet Vampa. Broly's father Paragus follows after him, intent on rescuing his son. However, his ship gets damaged, causing the two to spend years trapped on the barren world, unaware of the salvation that would one day come from an unlikely ally.\n\nYears later on Earth, Gokuu Son and Prince Vegeta—believed to be the last survivors of the Saiyan race—are busy training on a remote island. But their sparring is interrupted when the appearance of their old enemy Frieza drives them to search for the last of the wish-granting Dragon Balls on a frozen continent. Once there, Frieza shows off his new allies: Paragus and the now extremely powerful Broly. A legendary battle that shakes the foundation of the world ensues as Gokuu and Vegeta face off against Broly, a warrior without equal whose rage is just waiting to be unleashed.\n\n[Written by MAL Rewrite]",
        "mean": 8.2,
        "rank": 423,
        "popularity": 556,
        "num_episodes": 1,
        "status": "finished_airing",
        "genres": [
          {
            "id": 1,
            "name": "Action"
          },
          {
            "id": 2,
            "name": "Adventure"
          },
          {
            "id": 10,
            "name": "Fantasy"
          },
          {
            "id": 17,
            "name": "Martial Arts"
          },
          {
            "id": 27,
            "name": "Shounen"
          }
        ],
        "media_type": "movie",
        "rating": "pg_13",
        "my_list_status": {
          "status": "completed",
          "score": 6,
          "num_episodes_watched": 1,
          "is_rewatching": false,
          "updated_at": "2025-10-17T22:39:42+00:00",
          "tags": [],
          "comments": ""
        }
      }
    },
    {
      "node": {
        "id": 813,
        "title": "Dragon Ball Z",
        "main_picture": {
          "medium": "https://cdn.myanimelist.net/images/anime/1277/142022.webp",
          "large": "https://cdn.myanimelist.net/images/anime/1277/142022l.webp"
        },
        "alternative_titles": {
          "synonyms": ["DBZ", "Dragonball Z"],
          "en": "Dragon Ball Z",
          "ja": "ドラゴンボールZ"
        },
        "start_date": "1989-04-26",
        "end_date": "1996-01-31",
        "synopsis": "Five years after winning the World Martial Arts tournament, Gokuu is now living a peaceful life with his wife and son. This changes, however, with the arrival of a mysterious enemy named Raditz who presents himself as Gokuu's long-lost brother. He reveals that Gokuu is a descendant of the once powerful but now virtually extinct Saiyan race, whose homeworld was annihilated. When he was sent to Earth as a baby, Gokuu's sole purpose was to conquer and destroy the planet; but after suffering amnesia from a head injury, his violent and savage nature changed, and instead was raised as a kind and well-mannered boy, now fighting to protect others.\n\nWith his failed attempt at forcibly recruiting Gokuu as an ally, Raditz warns Gokuu's friends of a new threat that's rapidly approaching Earth—one that could plunge Earth into an intergalactic conflict and cause the heavens themselves to shake. A war will soon be fought over the seven mystical Dragon Balls, magic objects that can grant any wish. Only the strongest will survive.\n\n[Written by MAL Rewrite]",
        "mean": 8.2,
        "rank": 424,
        "popularity": 116,
        "num_episodes": 291,
        "status": "finished_airing",
        "genres": [
          {
            "id": 1,
            "name": "Action"
          },
          {
            "id": 2,
            "name": "Adventure"
          },
          {
            "id": 4,
            "name": "Comedy"
          },
          {
            "id": 10,
            "name": "Fantasy"
          },
          {
            "id": 17,
            "name": "Martial Arts"
          },
          {
            "id": 27,
            "name": "Shounen"
          }
        ],
        "media_type": "tv",
        "rating": "pg_13",
        "my_list_status": {
          "status": "completed",
          "score": 7,
          "num_episodes_watched": 291,
          "is_rewatching": false,
          "updated_at": "2025-01-04T06:31:12+00:00",
          "tags": [],
          "comments": ""
        }
      }
    },
    {
      "node": {
        "id": 5114,
        "title": "Fullmetal Alchemist: Brotherhood",
        "main_picture": {
          "medium": "https://cdn.myanimelist.net/images/anime/1208/94745.webp",
          "large": "https://cdn.myanimelist.net/images/anime/1208/94745l.webp"
        },
        "alternative_titles": {
          "synonyms": [
            "Hagane no Renkinjutsushi: Fullmetal Alchemist",
            "Fullmetal Alchemist (2009)",
            "FMA",
            "FMAB"
          ],
          "en": "Fullmetal Alchemist: Brotherhood",
          "ja": "鋼の錬金術師 FULLMETAL ALCHEMIST"
        },
        "start_date": "2009-04-05",
        "end_date": "2010-07-04",
        "synopsis": "After a horrific alchemy experiment goes wrong in the Elric household, brothers Edward and Alphonse are left in a catastrophic new reality. Ignoring the alchemical principle banning human transmutation, the boys attempted to bring their recently deceased mother back to life. Instead, they suffered brutal personal loss: Alphonse's body disintegrated while Edward lost a leg and then sacrificed an arm to keep Alphonse's soul in the physical realm by binding it to a hulking suit of armor.\n\nThe brothers are rescued by their neighbor Pinako Rockbell and her granddaughter Winry. Known as a bio-mechanical engineering prodigy, Winry creates prosthetic limbs for Edward by utilizing \"automail,\" a tough, versatile metal used in robots and combat armor. After years of training, the Elric brothers set off on a quest to restore their bodies by locating the Philosopher's Stone—a powerful gem that allows an alchemist to defy the traditional laws of Equivalent Exchange.\n\nAs Edward becomes an infamous alchemist and gains the nickname \"Fullmetal,\" the boys' journey embroils them in a growing conspiracy that threatens the fate of the world.\n\n[Written by MAL Rewrite]",
        "mean": 9.1,
        "rank": 4,
        "popularity": 3,
        "num_episodes": 64,
        "status": "finished_airing",
        "genres": [
          {
            "id": 1,
            "name": "Action"
          },
          {
            "id": 2,
            "name": "Adventure"
          },
          {
            "id": 8,
            "name": "Drama"
          },
          {
            "id": 10,
            "name": "Fantasy"
          },
          {
            "id": 38,
            "name": "Military"
          },
          {
            "id": 27,
            "name": "Shounen"
          }
        ],
        "media_type": "tv",
        "rating": "r",
        "my_list_status": {
          "status": "completed",
          "score": 0,
          "num_episodes_watched": 64,
          "is_rewatching": false,
          "updated_at": "2025-01-04T07:10:52+00:00",
          "tags": [],
          "comments": ""
        }
      }
    },
    {
      "node": {
        "id": 14719,
        "title": "JoJo no Kimyou na Bouken (TV)",
        "main_picture": {
          "medium": "https://cdn.myanimelist.net/images/anime/3/40409.webp",
          "large": "https://cdn.myanimelist.net/images/anime/3/40409l.webp"
        },
        "alternative_titles": {
          "synonyms": [
            "JoJo no Kimyou na Bouken (2012)",
            "Battle Tendency",
            "Phantom Blood",
            "Sentou Chouryuu",
            "JoJo's Bizarre Adventure The Animation"
          ],
          "en": "JoJo's Bizarre Adventure (2012)",
          "ja": "ジョジョの奇妙な冒険"
        },
        "start_date": "2012-10-06",
        "end_date": "2013-04-06",
        "synopsis": "The year is 1868; English nobleman George Joestar and his son Jonathan become indebted to Dario Brando after being rescued from a carriage incident. What the Joestars don't realize, however, is that Dario had no intention of helping them; he believed they were dead and was trying to ransack their belongings. After Dario's death 12 years later, George—hoping to repay his debt—adopts his son, Dio. \n\nWhile he publicly fawns over his new father, Dio secretly plans to steal the Joestar fortune. His first step is to create a divide between George and Jonathan. By constantly outdoing his foster brother, Dio firmly makes his place in the Joestar family. But when Dio pushes Jonathan too far, Jonathan defeats him in a brawl. \n\nYears later, the two appear to be close friends to the outside world. But trouble brews again when George falls ill, as Jonathan suspects that Dio is somehow behind the incident—and it appears he has more tricks up his sleeve.\n\n[Written by MAL Rewrite]",
        "mean": 7.87,
        "rank": 961,
        "popularity": 60,
        "num_episodes": 26,
        "status": "finished_airing",
        "genres": [
          {
            "id": 1,
            "name": "Action"
          },
          {
            "id": 2,
            "name": "Adventure"
          },
          {
            "id": 13,
            "name": "Historical"
          },
          {
            "id": 27,
            "name": "Shounen"
          },
          {
            "id": 37,
            "name": "Supernatural"
          },
          {
            "id": 32,
            "name": "Vampire"
          }
        ],
        "media_type": "tv",
        "rating": "r",
        "my_list_status": {
          "status": "completed",
          "score": 8,
          "num_episodes_watched": 26,
          "is_rewatching": false,
          "updated_at": "2025-01-04T06:23:47+00:00",
          "tags": [],
          "comments": ""
        }
      }
    },
    {
      "node": {
        "id": 20899,
        "title": "JoJo no Kimyou na Bouken Part 3: Stardust Crusaders",
        "main_picture": {
          "medium": "https://cdn.myanimelist.net/images/anime/11/55267.webp",
          "large": "https://cdn.myanimelist.net/images/anime/11/55267l.webp"
        },
        "alternative_titles": {
          "synonyms": [
            "Dai San Bu Kuujou Joutarou: Mirai e no Isan",
            "JoJo's Bizarre Adventure Part 3"
          ],
          "en": "JoJo's Bizarre Adventure: Stardust Crusaders",
          "ja": "ジョジョの奇妙な冒険 スターダストクルセイダース"
        },
        "start_date": "2014-04-05",
        "end_date": "2014-09-13",
        "synopsis": "Years after an ancient evil was salvaged from the depths of the sea, Joutarou Kuujou sits peacefully within a Japanese jail cell. He's committed no crime yet demands he not be released, believing he's been possessed by an evil spirit capable of harming those around him. Concerned for her son, Holy Kuujou asks her father, Joseph Joestar, to convince Joutarou to leave the prison. Joseph informs his grandson that the \"evil spirit\" is in fact something called a \"Stand,\" the physical manifestation of one's fighting spirit which can adopt a variety of deadly forms. After a fiery brawl with Joseph's friend Muhammad Avdol, Joutarou is forced out of his cell and begins learning how to control the power of his Stand.\n\nHowever, when a Stand awakens within Holy and threatens to consume her in 50 days, Joutarou, his grandfather, and their allies must seek out and destroy the immortal vampire responsible for her condition. They must travel halfway across the world to Cairo, Egypt and along the way, do battle with ferocious Stand users set on thwarting them. If Joutarou and his allies fail in their mission, humanity is destined for a grim fate.\n\n[Written by MAL Rewrite]",
        "mean": 8.11,
        "rank": 558,
        "popularity": 108,
        "num_episodes": 24,
        "status": "finished_airing",
        "genres": [
          {
            "id": 1,
            "name": "Action"
          },
          {
            "id": 2,
            "name": "Adventure"
          },
          {
            "id": 27,
            "name": "Shounen"
          },
          {
            "id": 31,
            "name": "Super Power"
          }
        ],
        "media_type": "tv",
        "rating": "r",
        "my_list_status": {
          "status": "completed",
          "score": 9,
          "num_episodes_watched": 24,
          "is_rewatching": false,
          "updated_at": "2025-01-04T06:24:14+00:00",
          "tags": [],
          "comments": ""
        }
      }
    },
    {
      "node": {
        "id": 26055,
        "title": "JoJo no Kimyou na Bouken Part 3: Stardust Crusaders - Egypt-hen",
        "main_picture": {
          "medium": "https://cdn.myanimelist.net/images/anime/11/75045.webp",
          "large": "https://cdn.myanimelist.net/images/anime/11/75045l.webp"
        },
        "alternative_titles": {
          "synonyms": [
            "JoJo's Bizarre Adventure Part 3",
            "JoJo's Bizarre Adventure: Stardust Crusaders - Egypt Arc"
          ],
          "en": "JoJo's Bizarre Adventure: Stardust Crusaders - Battle in Egypt",
          "ja": "ジョジョの奇妙な冒険 スターダストクルセイダース エジプト編"
        },
        "start_date": "2015-01-10",
        "end_date": "2015-06-20",
        "synopsis": "Joutarou Kuujou and his allies have finally made it to Egypt, where the immortal Dio awaits. Upon their arrival, the group gains a new comrade: Iggy, a mutt who wields the Stand \"The Fool.\" It's not all good news however, as standing in their path is a new group of Stand users who serve Dio, each with a Stand representative of an ancient Egyptian god. As their final battle approaches, it is a race against time to break Joutarou's mother free from her curse and end Dio's reign of terror over the Joestar family once and for all.\n\n[Written by MAL Rewrite]",
        "mean": 8.44,
        "rank": 190,
        "popularity": 133,
        "num_episodes": 24,
        "status": "finished_airing",
        "genres": [
          {
            "id": 1,
            "name": "Action"
          },
          {
            "id": 2,
            "name": "Adventure"
          },
          {
            "id": 27,
            "name": "Shounen"
          },
          {
            "id": 31,
            "name": "Super Power"
          }
        ],
        "media_type": "tv",
        "rating": "r",
        "my_list_status": {
          "status": "completed",
          "score": 10,
          "num_episodes_watched": 24,
          "is_rewatching": false,
          "updated_at": "2025-01-04T06:24:25+00:00",
          "tags": [],
          "comments": ""
        }
      }
    },
    {
      "node": {
        "id": 31933,
        "title": "JoJo no Kimyou na Bouken Part 4: Diamond wa Kudakenai",
        "main_picture": {
          "medium": "https://cdn.myanimelist.net/images/anime/3/79156.webp",
          "large": "https://cdn.myanimelist.net/images/anime/3/79156l.webp"
        },
        "alternative_titles": {
          "synonyms": [
            "JoJo no Kimyou na Bouken Part 4: Diamond wa Kudakenai",
            "Diamond is not Crash"
          ],
          "en": "JoJo's Bizarre Adventure: Diamond Is Unbreakable",
          "ja": "ジョジョの奇妙な冒険 ダイヤモンドは砕けない"
        },
        "start_date": "2016-04-02",
        "end_date": "2016-12-24",
        "synopsis": "The year is 1999. Morioh, a normally quiet and peaceful town, has recently become a hotbed of strange activity. Joutarou Kuujou, now a marine biologist, heads to the mysterious town to meet Jousuke Higashikata. While the two may seem like strangers at first, Jousuke is actually the illegitimate child of Joutarou's grandfather, Joseph Joestar. When they meet, Joutarou realizes that he may have more in common with Jousuke than just a blood relation.\n\nAlong with the mild-mannered Kouichi Hirose and the boisterous Okuyasu Nijimura, the group dedicates themselves to investigating recent disappearances and other suspicious occurrences within Morioh. Aided by the power of Stands, the four men will encounter danger at every street corner, as it is up to them to unravel the town's secrets, before another occurs.\n\n[Written by MAL Rewrite]",
        "mean": 8.5,
        "rank": 158,
        "popularity": 129,
        "num_episodes": 39,
        "status": "finished_airing",
        "genres": [
          {
            "id": 1,
            "name": "Action"
          },
          {
            "id": 2,
            "name": "Adventure"
          },
          {
            "id": 27,
            "name": "Shounen"
          },
          {
            "id": 31,
            "name": "Super Power"
          }
        ],
        "media_type": "tv",
        "rating": "r",
        "my_list_status": {
          "status": "completed",
          "score": 7,
          "num_episodes_watched": 39,
          "is_rewatching": false,
          "updated_at": "2025-01-04T06:24:32+00:00",
          "tags": [],
          "comments": ""
        }
      }
    },
    {
      "node": {
        "id": 37991,
        "title": "JoJo no Kimyou na Bouken Part 5: Ougon no Kaze",
        "main_picture": {
          "medium": "https://cdn.myanimelist.net/images/anime/1882/94989.webp",
          "large": "https://cdn.myanimelist.net/images/anime/1882/94989l.webp"
        },
        "alternative_titles": {
          "synonyms": [
            "JoJo's Bizarre Adventure Part 5: Golden Wind",
            "JoJo no Kimyou na Bouken Part 5: Ougon no Kaze",
            "Le Bizzarre Avventure Di GioGio Parte 5: Vento Aureo"
          ],
          "en": "JoJo's Bizarre Adventure: Golden Wind",
          "ja": "ジョジョの奇妙な冒険 黄金の風"
        },
        "start_date": "2018-10-06",
        "end_date": "2019-07-28",
        "synopsis": "In the coastal city of Naples, corruption is teeming—the police blatantly conspire with outlaws, drugs run rampant around the youth, and the mafia governs the streets with an iron fist. However, various fateful encounters will soon occur.\n\nEnter Giorno Giovanna, a 15-year-old boy with an eccentric connection to the Joestar family, who makes a living out of part-time jobs and pickpocketing. Furthermore, he is gifted with the unexplained Stand ability to give and create life—growing plants from the ground and turning inanimate objects into live animals, an ability he has dubbed \"Gold Experience.\" Fascinated by the might of local gangsters, Giorno has dreamed of rising up in their ranks and becoming a \"Gang-Star,\" a feat made possible by his encounter with Bruno Bucciarati, a member of the Passione gang with his own sense of justice.\n\nJoJo no Kimyou na Bouken: Ougon no Kaze follows the endeavors of Giorno after joining Bruno's team while working under Passione, fending off other gangsters and secretly plotting to overthrow their mysterious boss.\n\n[Written by MAL Rewrite]",
        "mean": 8.58,
        "rank": 115,
        "popularity": 146,
        "num_episodes": 39,
        "status": "finished_airing",
        "genres": [
          {
            "id": 1,
            "name": "Action"
          },
          {
            "id": 2,
            "name": "Adventure"
          },
          {
            "id": 68,
            "name": "Organized Crime"
          },
          {
            "id": 27,
            "name": "Shounen"
          },
          {
            "id": 31,
            "name": "Super Power"
          }
        ],
        "media_type": "tv",
        "rating": "r",
        "my_list_status": {
          "status": "completed",
          "score": 10,
          "num_episodes_watched": 39,
          "is_rewatching": false,
          "updated_at": "2025-01-04T06:25:05+00:00",
          "tags": [],
          "comments": ""
        }
      }
    },
    {
      "node": {
        "id": 48661,
        "title": "JoJo no Kimyou na Bouken Part 6: Stone Ocean",
        "main_picture": {
          "medium": "https://cdn.myanimelist.net/images/anime/1896/119844.jpg",
          "large": "https://cdn.myanimelist.net/images/anime/1896/119844l.jpg"
        },
        "alternative_titles": {
          "synonyms": ["JoJo's Bizarre Adventure Part 6: Stone Ocean"],
          "en": "JoJo's Bizarre Adventure: Stone Ocean",
          "ja": "ジョジョの奇妙な冒険 ストーンオーシャン"
        },
        "start_date": "2021-12-01",
        "end_date": "2021-12-01",
        "synopsis": "Conspiring forces frame Jolyne Kuujou for a reckless crime, landing her in the infamous Green Dolphin Street Jail. Much like her father Joutarou, Jolyne is brash, brave, and just; she rails against her unfair sentence and quickly discovers the sinister circumstances that led to her incarceration.\n\nA gift from her absent father grants Jolyne the power of Stone Free, a supernatural ability known as a Stand that allows her to unravel her body into string. Jolyne uses Stone Free to battle her way through the prison, recruiting new allies—Ermes Costello and Foo Fighters—to assist in her investigation. Together, the fearless women fight to uncover the menace behind Whitesnake, an enemy Stand responsible for the increasingly dangerous prisoners who are after Jolyne's life.\n\nThrough Jolyne, the Joestar lineage confronts the legacy of its one true enemy. Jolyne and her friends race to stop a disastrous plot and put an end to a culminating evil.\n\n[Written by MAL Rewrite]",
        "mean": 8.06,
        "rank": 625,
        "popularity": 415,
        "num_episodes": 12,
        "status": "finished_airing",
        "genres": [
          {
            "id": 1,
            "name": "Action"
          },
          {
            "id": 2,
            "name": "Adventure"
          },
          {
            "id": 27,
            "name": "Shounen"
          },
          {
            "id": 31,
            "name": "Super Power"
          }
        ],
        "media_type": "ona",
        "rating": "r",
        "my_list_status": {
          "status": "completed",
          "score": 9,
          "num_episodes_watched": 12,
          "is_rewatching": false,
          "updated_at": "2025-10-17T22:39:25+00:00",
          "finish_date": "2024-02-06",
          "tags": [],
          "comments": ""
        }
      }
    },
    {
      "node": {
        "id": 40839,
        "title": "Kanojo, Okarishimasu",
        "main_picture": {
          "medium": "https://cdn.myanimelist.net/images/anime/1902/128382.webp",
          "large": "https://cdn.myanimelist.net/images/anime/1902/128382l.webp"
        },
        "alternative_titles": {
          "synonyms": ["I'd like to Borrow a Girlfriend", "Kanokari"],
          "en": "Rent-a-Girlfriend",
          "ja": "彼女、お借りします"
        },
        "start_date": "2020-07-11",
        "end_date": "2020-09-26",
        "synopsis": "Kazuya Kinoshita is a 20-year-old college student who has a wonderful girlfriend: the bright and sunny Mami Nanami. But suddenly, he does not. Without warning, Mami breaks up with him, leaving him utterly heartbroken and lonely. Seeking to soothe the pain, he hires a rental girlfriend through an online app. His partner is Chizuru Mizuhara, who through her unparalleled beauty and cute demeanor, manages to gain Kazuya's affection.\n\nBut after reading similar experiences other customers had had with Chizuru, Kazuya believes her warm smile and caring personality were all just an act to toy with his heart, and he rates her poorly. Aggravated, Chizuru lambastes him for his shameless hypocrisy, revealing her true pert and hot-tempered self. This one-sided exchange is cut short, however, when Kazuya finds out that his grandmother has collapsed.\n\nThey dash toward the hospital and find Kazuya's grandmother already in good condition. Baffled by Chizuru's presence, she asks who this girl might be. On impulse, Kazuya promptly declares that they are lovers, forcing Chizuru to play the part. But with Kazuya still hung up on his previous relationship with Mami, how long can this difficult client and reluctant rental girlfriend keep up their act?\n\n[Written by MAL Rewrite]",
        "mean": 6.86,
        "rank": 5280,
        "popularity": 168,
        "num_episodes": 12,
        "status": "finished_airing",
        "genres": [
          {
            "id": 50,
            "name": "Adult Cast"
          },
          {
            "id": 4,
            "name": "Comedy"
          },
          {
            "id": 35,
            "name": "Harem"
          },
          {
            "id": 22,
            "name": "Romance"
          },
          {
            "id": 27,
            "name": "Shounen"
          }
        ],
        "media_type": "tv",
        "rating": "pg_13",
        "my_list_status": {
          "status": "completed",
          "score": 7,
          "num_episodes_watched": 12,
          "is_rewatching": false,
          "updated_at": "2025-10-17T22:55:49+00:00",
          "tags": [],
          "comments": ""
        }
      }
    },
    {
      "node": {
        "id": 18679,
        "title": "Kill la Kill",
        "main_picture": {
          "medium": "https://cdn.myanimelist.net/images/anime/1464/111943.jpg",
          "large": "https://cdn.myanimelist.net/images/anime/1464/111943l.jpg"
        },
        "alternative_titles": {
          "synonyms": ["KLK", "Dressed to Kill"],
          "en": "Kill la Kill",
          "ja": "キルラキル"
        },
        "start_date": "2013-10-04",
        "end_date": "2014-03-28",
        "synopsis": "After the murder of her father, Ryuuko Matoi has been wandering the land in search of his killer. Following her only lead—the missing half of his invention, the Scissor Blade—she arrives at the prestigious Honnouji Academy, a high school unlike any other. The academy is ruled by the imposing and cold-hearted student council president Satsuki Kiryuuin alongside her powerful underlings, the Elite Four. In the school's brutally competitive hierarchy, Satsuki bestows upon those at the top special clothes called \"Goku Uniforms,\" which grant the wearer unique superhuman abilities. \n\nThoroughly beaten in a fight against one of the students in uniform, Ryuuko retreats to her razed home where she stumbles across Senketsu, a rare and sentient \"Kamui,\" or God Clothes. After coming into contact with Ryuuko's blood, Senketsu awakens, latching onto her and providing her with immense power. Now, armed with Senketsu and the Scissor Blade, Ryuuko makes a stand against the Elite Four, hoping to reach Satsuki and uncover the culprit behind her father's murder once and for all. \n\n[Written by MAL Rewrite]",
        "mean": 8.03,
        "rank": 674,
        "popularity": 59,
        "num_episodes": 24,
        "status": "finished_airing",
        "genres": [
          {
            "id": 1,
            "name": "Action"
          },
          {
            "id": 4,
            "name": "Comedy"
          },
          {
            "id": 9,
            "name": "Ecchi"
          },
          {
            "id": 10,
            "name": "Fantasy"
          },
          {
            "id": 23,
            "name": "School"
          },
          {
            "id": 82,
            "name": "Urban Fantasy"
          }
        ],
        "media_type": "tv",
        "rating": "pg_13",
        "my_list_status": {
          "status": "completed",
          "score": 7,
          "num_episodes_watched": 24,
          "is_rewatching": false,
          "updated_at": "2025-01-04T07:06:23+00:00",
          "tags": [],
          "comments": ""
        }
      }
    },
    {
      "node": {
        "id": 33206,
        "title": "Kobayashi-san Chi no Maid Dragon",
        "main_picture": {
          "medium": "https://cdn.myanimelist.net/images/anime/5/85434.webp",
          "large": "https://cdn.myanimelist.net/images/anime/5/85434l.webp"
        },
        "alternative_titles": {
          "synonyms": ["The maid dragon of Kobayashi-san"],
          "en": "Miss Kobayashi's Dragon Maid",
          "ja": "小林さんちのメイドラゴン"
        },
        "start_date": "2017-01-12",
        "end_date": "2017-04-06",
        "synopsis": "As Kobayashi sets off for another day at work, she opens her apartment door only to be met by an unusually frightening sight—the head of a dragon, staring at her from across the balcony. The dragon immediately transforms into a cute, busty, and energetic young girl dressed in a maid outfit, introducing herself as Tooru.\n\nIt turns out that the stoic programmer had come across the dragon the previous night on a drunken excursion to the mountains, and since the mythical beast had nowhere else to go, she had offered the creature a place to stay in her home. Thus, Tooru had arrived to cash in on the offer, ready to repay her savior's kindness by working as her personal maidservant. Though deeply regretful of her words and hesitant to follow through on her promise, a mix of guilt and Tooru's incredible dragon abilities convinces Kobayashi to take the girl in.\n\nDespite being extremely efficient at her job, the maid's unorthodox methods of housekeeping often end up horrifying Kobayashi and at times bring more trouble than help. Furthermore, the circumstances behind the dragon's arrival on Earth seem to be much more complicated than at first glance, as Tooru bears some heavy emotions and painful memories. To top it all off, Tooru's presence ends up attracting several other mythical beings to her new home, bringing in a host of eccentric personalities. Although Kobayashi makes her best effort to handle the crazy situation that she has found herself in, nothing has prepared her for this new life with a dragon maid.\n\n[Written by MAL Rewrite]",
        "mean": 7.91,
        "rank": 861,
        "popularity": 114,
        "num_episodes": 13,
        "status": "finished_airing",
        "genres": [
          {
            "id": 36,
            "name": "Slice of Life"
          },
          {
            "id": 37,
            "name": "Supernatural"
          }
        ],
        "media_type": "tv",
        "rating": "pg_13",
        "my_list_status": {
          "status": "completed",
          "score": 8,
          "num_episodes_watched": 13,
          "is_rewatching": false,
          "updated_at": "2025-01-04T06:36:09+00:00",
          "tags": [],
          "comments": ""
        }
      }
    },
    {
      "node": {
        "id": 39247,
        "title": "Kobayashi-san Chi no Maid Dragon S",
        "main_picture": {
          "medium": "https://cdn.myanimelist.net/images/anime/1252/115539.jpg",
          "large": "https://cdn.myanimelist.net/images/anime/1252/115539l.jpg"
        },
        "alternative_titles": {
          "synonyms": [
            "Kobayashi-san Chi no Maid Dragon 2nd Season",
            "Miss Kobayashi's Dragon Maid 2nd Season"
          ],
          "en": "Miss Kobayashi's Dragon Maid S",
          "ja": "小林さんちのメイドラゴンS"
        },
        "start_date": "2021-07-08",
        "end_date": "2021-09-23",
        "synopsis": "As Tooru continues on her quest to become the greatest maid and Kanna Kamui fully immerses in her life as an elementary school student, there is not a dull day in the Kobayashi household with mischief being a daily staple. On one such day, however, a massive landslide is spotted on the hill where Kobayashi and Tooru first met—a clear display of a dragon's might. When none of the dragons they know claim responsibility, the perpetrator herself descends from the skies: Ilulu, the radical Chaos Dragon with monstrous power rivaling that of Tooru.\n\nSickened by Tooru's involvement with humans, Ilulu resorts to the typical dragon method of resolving conflict—a battle to the death. Despite such behavior, she becomes intrigued by Kobayashi's ability to befriend dragons and decides instead to observe just what makes Kobayashi so special. With a new troublesome dragon in town, Kobayashi's eccentric life with a dragon maid is only getting merrier.\n\n[Written by MAL Rewrite]",
        "mean": 8.21,
        "rank": 409,
        "popularity": 407,
        "num_episodes": 12,
        "status": "finished_airing",
        "genres": [
          {
            "id": 36,
            "name": "Slice of Life"
          },
          {
            "id": 37,
            "name": "Supernatural"
          }
        ],
        "media_type": "tv",
        "rating": "pg_13",
        "my_list_status": {
          "status": "completed",
          "score": 8,
          "num_episodes_watched": 12,
          "is_rewatching": false,
          "updated_at": "2025-01-04T06:36:15+00:00",
          "tags": [],
          "comments": ""
        }
      }
    },
    {
      "node": {
        "id": 28851,
        "title": "Koe no Katachi",
        "main_picture": {
          "medium": "https://cdn.myanimelist.net/images/anime/1122/96435.webp",
          "large": "https://cdn.myanimelist.net/images/anime/1122/96435l.webp"
        },
        "alternative_titles": {
          "synonyms": ["The Shape of Voice"],
          "en": "A Silent Voice",
          "ja": "聲の形"
        },
        "start_date": "2016-09-17",
        "end_date": "2016-09-17",
        "synopsis": "As a wild youth, elementary school student Shouya Ishida sought to beat boredom in the cruelest ways. When the deaf Shouko Nishimiya transfers into his class, Shouya and the rest of his class thoughtlessly bully her for fun. However, when her mother notifies the school, he is singled out and blamed for everything done to her. With Shouko transferring out of the school, Shouya is left at the mercy of his classmates. He is heartlessly ostracized all throughout elementary and middle school, while teachers turn a blind eye.\n\nNow in his third year of high school, Shouya is still plagued by his wrongdoings as a young boy. Sincerely regretting his past actions, he sets out on a journey of redemption: to meet Shouko once more and make amends.\n\nKoe no Katachi tells the heartwarming tale of Shouya's reunion with Shouko and his honest attempts to redeem himself, all while being continually haunted by the shadows of his past.\n \n[Written by MAL Rewrite]",
        "mean": 8.93,
        "rank": 20,
        "popularity": 19,
        "num_episodes": 1,
        "status": "finished_airing",
        "genres": [
          {
            "id": 46,
            "name": "Award Winning"
          },
          {
            "id": 8,
            "name": "Drama"
          },
          {
            "id": 27,
            "name": "Shounen"
          }
        ],
        "media_type": "movie",
        "rating": "pg_13",
        "my_list_status": {
          "status": "completed",
          "score": 9,
          "num_episodes_watched": 1,
          "is_rewatching": false,
          "updated_at": "2025-01-04T06:47:44+00:00",
          "tags": [],
          "comments": ""
        }
      }
    },
    {
      "node": {
        "id": 30831,
        "title": "Kono Subarashii Sekai ni Shukufuku wo!",
        "main_picture": {
          "medium": "https://cdn.myanimelist.net/images/anime/1895/142748.jpg",
          "large": "https://cdn.myanimelist.net/images/anime/1895/142748l.jpg"
        },
        "alternative_titles": {
          "synonyms": ["Give Blessings to This Wonderful World!"],
          "en": "KonoSuba: God's Blessing on This Wonderful World!",
          "ja": "この素晴らしい世界に祝福を！"
        },
        "start_date": "2016-01-14",
        "end_date": "2016-03-17",
        "synopsis": "After dying a laughable and pathetic death on his way back from buying a game, high school student and recluse Kazuma Satou finds himself sitting before a beautiful but obnoxious goddess named Aqua. She provides the NEET with two options: continue on to heaven or reincarnate in every gamer's dream—a real fantasy world! Choosing to start a new life, Kazuma is quickly tasked with defeating a Demon King who is terrorizing villages. But before he goes, he can choose one item of any kind to aid him in his quest, and the future hero selects Aqua. But Kazuma has made a grave mistake—Aqua is completely useless!\n\nUnfortunately, their troubles don't end here; it turns out that living in such a world is far different from how it plays out in a game. Instead of going on a thrilling adventure, the duo must first work to pay for their living expenses. Indeed, their misfortunes have only just begun!\n\n[Written by MAL Rewrite]",
        "mean": 8.09,
        "rank": 583,
        "popularity": 38,
        "num_episodes": 10,
        "status": "finished_airing",
        "genres": [
          {
            "id": 2,
            "name": "Adventure"
          },
          {
            "id": 4,
            "name": "Comedy"
          },
          {
            "id": 10,
            "name": "Fantasy"
          },
          {
            "id": 62,
            "name": "Isekai"
          },
          {
            "id": 20,
            "name": "Parody"
          }
        ],
        "media_type": "tv",
        "rating": "pg_13",
        "my_list_status": {
          "status": "completed",
          "score": 5,
          "num_episodes_watched": 10,
          "is_rewatching": false,
          "updated_at": "2025-01-04T06:49:05+00:00",
          "tags": [],
          "comments": ""
        }
      }
    },
    {
      "node": {
        "id": 39535,
        "title": "Mushoku Tensei: Isekai Ittara Honki Dasu",
        "main_picture": {
          "medium": "https://cdn.myanimelist.net/images/anime/1530/117776.jpg",
          "large": "https://cdn.myanimelist.net/images/anime/1530/117776l.jpg"
        },
        "alternative_titles": {
          "synonyms": [
            "Jobless Reincarnation: I Will Seriously Try If I Go To Another World"
          ],
          "en": "Mushoku Tensei: Jobless Reincarnation",
          "ja": "無職転生 ～異世界行ったら本気だす～"
        },
        "start_date": "2021-01-11",
        "end_date": "2021-03-22",
        "synopsis": "Despite being bullied, scorned, and oppressed all of his life, a 34-year-old shut-in still found the resolve to attempt something heroic—only for it to end in a tragic accident. But in a twist of fate, he awakens in another world as Rudeus Greyrat, starting life again as a baby born to two loving parents.\n\nPreserving his memories and knowledge from his previous life, Rudeus quickly adapts to his new environment. With the mind of a grown adult, he starts to display magical talent that exceeds all expectations, honing his skill with the help of a mage named Roxy Migurdia. Rudeus learns swordplay from his father, Paul, and meets Sylphiette, a girl his age who quickly becomes his closest friend.\n\nAs Rudeus' second chance at life begins, he tries to make the most of his new opportunity while conquering his traumatic past. And perhaps, one day, he may find the one thing he could not find in his old world—love.\n\n[Written by MAL Rewrite]",
        "mean": 8.34,
        "rank": 280,
        "popularity": 89,
        "num_episodes": 11,
        "status": "finished_airing",
        "genres": [
          {
            "id": 2,
            "name": "Adventure"
          },
          {
            "id": 8,
            "name": "Drama"
          },
          {
            "id": 9,
            "name": "Ecchi"
          },
          {
            "id": 10,
            "name": "Fantasy"
          },
          {
            "id": 62,
            "name": "Isekai"
          },
          {
            "id": 72,
            "name": "Reincarnation"
          }
        ],
        "media_type": "tv",
        "rating": "r",
        "my_list_status": {
          "status": "completed",
          "score": 9,
          "num_episodes_watched": 11,
          "is_rewatching": false,
          "updated_at": "2025-01-04T06:38:45+00:00",
          "tags": [],
          "comments": ""
        }
      }
    },
    {
      "node": {
        "id": 20,
        "title": "Naruto",
        "main_picture": {
          "medium": "https://cdn.myanimelist.net/images/anime/1141/142503.webp",
          "large": "https://cdn.myanimelist.net/images/anime/1141/142503l.webp"
        },
        "alternative_titles": {
          "synonyms": ["NARUTO"],
          "en": "Naruto",
          "ja": "ナルト"
        },
        "start_date": "2002-10-03",
        "end_date": "2007-02-08",
        "synopsis": "Twelve years ago, a colossal demon fox terrorized the world. During the monster's attack on the Hidden Leaf Village, the Hokage—the village's leader and most powerful ninja—sacrifices himself to seal the beast inside a newborn, relieving civilization from destruction while dooming the baby to a lonely life.\n\nNow, after years of being shunned and bullied, Naruto Uzumaki pesters the village with elaborate pranks and vandalism. Despite these antics, he works hard to achieve his dream: to become the Hokage and earn the acknowledgement of those who have mistreated him for his entire life. Naruto joins Team 7, a ninja squad made up of two of his peers—prodigy Sasuke Uchiha and clever Sakura Haruno.\n\nUnder the aloof Kakashi Hatake's leadership, Team 7 takes on a series of difficult missions, forcing its members to grow in strength and comradery despite their many differences. Naruto strives to stand out in his rivalry with Sasuke and earn the romantic affection of Sakura. But as the trio brush against danger and death, their tragic pasts threaten to tear them apart.\n\n[Written by MAL Rewrite]",
        "mean": 8.02,
        "rank": 694,
        "popularity": 9,
        "num_episodes": 220,
        "status": "finished_airing",
        "genres": [
          {
            "id": 1,
            "name": "Action"
          },
          {
            "id": 2,
            "name": "Adventure"
          },
          {
            "id": 10,
            "name": "Fantasy"
          },
          {
            "id": 17,
            "name": "Martial Arts"
          },
          {
            "id": 27,
            "name": "Shounen"
          }
        ],
        "media_type": "tv",
        "rating": "pg_13",
        "my_list_status": {
          "status": "completed",
          "score": 10,
          "num_episodes_watched": 220,
          "is_rewatching": false,
          "updated_at": "2025-10-17T22:34:11+00:00",
          "tags": [],
          "comments": ""
        }
      }
    },
    {
      "node": {
        "id": 1735,
        "title": "Naruto: Shippuuden",
        "main_picture": {
          "medium": "https://cdn.myanimelist.net/images/anime/1565/111305.jpg",
          "large": "https://cdn.myanimelist.net/images/anime/1565/111305l.jpg"
        },
        "alternative_titles": {
          "synonyms": ["Naruto Hurricane Chronicles"],
          "en": "Naruto Shippuden",
          "ja": "-ナルト- 疾風伝"
        },
        "start_date": "2007-02-15",
        "end_date": "2017-03-23",
        "synopsis": "It has been two and a half years since Naruto Uzumaki left Konohagakure, the Hidden Leaf Village, for intense training following events which fueled his desire to be stronger. Now Akatsuki, the mysterious organization of elite rogue ninja, is closing in on their grand plan which may threaten the safety of the entire shinobi world.\n \nAlthough Naruto is older and sinister events loom on the horizon, he has changed little in personality—still rambunctious and childish—though he is now far more confident and possesses an even greater determination to protect his friends and home. Come whatever may, Naruto will carry on with the fight for what is important to him, even at the expense of his own body, in the continuation of the saga about the boy who wishes to become Hokage.\n\n[Written by MAL Rewrite]",
        "mean": 8.29,
        "rank": 322,
        "popularity": 15,
        "num_episodes": 500,
        "status": "finished_airing",
        "genres": [
          {
            "id": 1,
            "name": "Action"
          },
          {
            "id": 2,
            "name": "Adventure"
          },
          {
            "id": 10,
            "name": "Fantasy"
          },
          {
            "id": 17,
            "name": "Martial Arts"
          },
          {
            "id": 27,
            "name": "Shounen"
          }
        ],
        "media_type": "tv",
        "rating": "pg_13",
        "my_list_status": {
          "status": "completed",
          "score": 8,
          "num_episodes_watched": 500,
          "is_rewatching": false,
          "updated_at": "2025-10-17T22:40:22+00:00",
          "tags": [],
          "comments": ""
        }
      }
    },
    {
      "node": {
        "id": 31404,
        "title": "Netoge no Yome wa Onnanoko ja Nai to Omotta?",
        "main_picture": {
          "medium": "https://cdn.myanimelist.net/images/anime/3/79414.webp",
          "large": "https://cdn.myanimelist.net/images/anime/3/79414l.webp"
        },
        "alternative_titles": {
          "synonyms": [
            "Net Game no Yome wa Onna no Ko ja Nai to Omotta?",
            "NetoYome"
          ],
          "en": "And you thought there is never a girl online?",
          "ja": "ネトゲの嫁は女の子じゃないと思った？"
        },
        "start_date": "2016-04-07",
        "end_date": "2016-06-23",
        "synopsis": "After mustering up the courage to propose to a girl in an online game, naive otaku Hideki \"Rusian\" Nishimura is devastated when she flat-out rejects him. To make matters worse, the girl reveals that she is actually an older man in real life. With his dreams crushed and his heart broken, Rusian comes to an abrupt decision in the midst of his raging fit: he will never trust another girl in an online game again.\n\nYears later, Rusian is now in a guild with three other players, one of whom possesses a female avatar by the name of Ako. Ako is deeply in love with Rusian and wants to marry him. Although he entertains the possibility that she might be a guy, Rusian accepts her proposal, claiming that her gender does not matter as long as she is cute in-game. However, after a discussion between the guild members that led to all of them having an offline meeting, Rusian finds out that Ako, along with the other members, is not just a girl but also his schoolmate.\n\n[Written by MAL Rewrite]",
        "mean": 6.66,
        "rank": 6436,
        "popularity": 418,
        "num_episodes": 12,
        "status": "finished_airing",
        "genres": [
          {
            "id": 4,
            "name": "Comedy"
          },
          {
            "id": 9,
            "name": "Ecchi"
          },
          {
            "id": 22,
            "name": "Romance"
          },
          {
            "id": 23,
            "name": "School"
          },
          {
            "id": 79,
            "name": "Video Game"
          }
        ],
        "media_type": "tv",
        "rating": "pg_13",
        "my_list_status": {
          "status": "completed",
          "score": 6,
          "num_episodes_watched": 12,
          "is_rewatching": false,
          "updated_at": "2025-01-04T06:34:41+00:00",
          "tags": [],
          "comments": ""
        }
      }
    },
    {
      "node": {
        "id": 19815,
        "title": "No Game No Life",
        "main_picture": {
          "medium": "https://cdn.myanimelist.net/images/anime/1074/111944.jpg",
          "large": "https://cdn.myanimelist.net/images/anime/1074/111944l.jpg"
        },
        "alternative_titles": {
          "synonyms": ["NGNL"],
          "en": "No Game, No Life",
          "ja": "ノーゲーム・ノーライフ"
        },
        "start_date": "2014-04-09",
        "end_date": "2014-06-25",
        "synopsis": "Sixteen sentient races inhabit Disboard, a world overseen by Tet, the One True God. The lowest of the sixteen—Imanity—consists of humans, a race with no affinity for magic. In a place where everything is decided through simple games, humankind seems to have no way out of their predicament—but the arrival of two outsiders poses a change.\n\nOn Earth, stepsiblings Sora and Shiro are two inseparable shut-ins who dominate various online games under the username \"Blank.\" While notorious on the internet, the pair believe that life is merely another dull game. However, after responding to a message from an unknown user, they are suddenly transported to Disboard. The mysterious sender turns out to be Tet, who informs them about the world's absolute rules. After Tet leaves, Sora and Shiro begin their search for more information and a place to stay, taking them to Elkia—Imanity's only remaining kingdom.\n\nThere, the duo encounters Stephanie Dola, an emotional girl vying for the kingdom's sovereignty. In desperation, she attempts to regain her father's throne, but her foolhardiness makes her goal unachievable. Inspired by the girl's motivation and passion, Sora and Shiro decide to aid Stephanie in getting Elkia back on its feet, ultimately aiming to become the new rulers of the enigmatic realm.\n\n[Written by MAL Rewrite]\n",
        "mean": 8.04,
        "rank": 657,
        "popularity": 21,
        "num_episodes": 12,
        "status": "finished_airing",
        "genres": [
          {
            "id": 4,
            "name": "Comedy"
          },
          {
            "id": 9,
            "name": "Ecchi"
          },
          {
            "id": 10,
            "name": "Fantasy"
          },
          {
            "id": 62,
            "name": "Isekai"
          },
          {
            "id": 11,
            "name": "Strategy Game"
          }
        ],
        "media_type": "tv",
        "rating": "pg_13",
        "my_list_status": {
          "status": "completed",
          "score": 8,
          "num_episodes_watched": 12,
          "is_rewatching": false,
          "updated_at": "2025-10-17T22:34:57+00:00",
          "tags": [],
          "comments": ""
        }
      }
    },
    {
      "node": {
        "id": 31490,
        "title": "One Piece Film: Gold",
        "main_picture": {
          "medium": "https://cdn.myanimelist.net/images/anime/1081/137690.webp",
          "large": "https://cdn.myanimelist.net/images/anime/1081/137690l.webp"
        },
        "alternative_titles": {
          "synonyms": ["One Piece Movie 13"],
          "en": "",
          "ja": "ONE PIECE FILM GOLD"
        },
        "start_date": "2016-07-23",
        "end_date": "2016-07-23",
        "synopsis": "Monkey D. Luffy and his Straw Hat Crew have finally arrived on Gran Tesoro, a ship carrying the largest entertainment city in the world. Drawn in by the chances of hitting the jackpot, the crew immediately head to the casino. There, they quickly find themselves on a winning streak, playing with what seems to be endless luck.\n\nWhen offered a special gamble by Gild Tesoro—the master of the city himself—the crew agrees, choosing to believe in their captain's luck. However, when they find themselves victims of a despicable scam, the crew quickly realize that there is something darker happening beneath the city's surface.\n\nLeft penniless and beaten down, the Straw Hat Crew are forced to rely on another gamble of a plan. With the help of a new friend or two, the group must work to reclaim what they've lost before time, and what remains of their luck, runs out.\n\n[Written by MAL Rewrite]",
        "mean": 7.86,
        "rank": 978,
        "popularity": 1119,
        "num_episodes": 1,
        "status": "finished_airing",
        "genres": [
          {
            "id": 1,
            "name": "Action"
          },
          {
            "id": 2,
            "name": "Adventure"
          },
          {
            "id": 10,
            "name": "Fantasy"
          },
          {
            "id": 27,
            "name": "Shounen"
          }
        ],
        "media_type": "movie",
        "rating": "pg_13",
        "my_list_status": {
          "status": "completed",
          "score": 7,
          "num_episodes_watched": 1,
          "is_rewatching": false,
          "updated_at": "2025-01-04T06:26:28+00:00",
          "tags": [],
          "comments": ""
        }
      }
    },
    {
      "node": {
        "id": 50410,
        "title": "One Piece Film: Red",
        "main_picture": {
          "medium": "https://cdn.myanimelist.net/images/anime/1668/125323.jpg",
          "large": "https://cdn.myanimelist.net/images/anime/1668/125323l.jpg"
        },
        "alternative_titles": {
          "synonyms": ["One Piece Movie 15"],
          "en": "One Piece Film: Red",
          "ja": "ONE PIECE FILM RED"
        },
        "start_date": "2022-08-06",
        "end_date": "2022-08-06",
        "synopsis": "As a child, Uta—the Red Hair Pirates' ex-musician and Monkey D. Luffy's childhood friend—promised that she would build a new era of freedom by performing joyful music for the world.\n\nLuffy and the Straw Hat Crew arrive at Uta's first ever live concert, where many fans have gathered to enjoy the diva's otherworldly singing. Due to a childhood trauma, Uta bears a deep-seated hatred for pirates; her happy reunion with Luffy is cut short when she learns that he has since become one. Luffy's refusal to change his ways results in Uta unleashing her powers on the Straw Hats. The crew soon learns that their minds have already been trapped in Uta's dream world since the beginning of the concert, while their unconscious bodies remain asleep in the real world.\n\nWith time quickly running out, the Straw Hats must find a way to escape the nightmare or be trapped in Uta's dream forever.\n\n[Written by MAL Rewrite]",
        "mean": 7.81,
        "rank": 1096,
        "popularity": 1245,
        "num_episodes": 1,
        "status": "finished_airing",
        "genres": [
          {
            "id": 1,
            "name": "Action"
          },
          {
            "id": 2,
            "name": "Adventure"
          },
          {
            "id": 46,
            "name": "Award Winning"
          },
          {
            "id": 4,
            "name": "Comedy"
          },
          {
            "id": 8,
            "name": "Drama"
          },
          {
            "id": 10,
            "name": "Fantasy"
          },
          {
            "id": 60,
            "name": "Idols (Female)"
          },
          {
            "id": 27,
            "name": "Shounen"
          }
        ],
        "media_type": "movie",
        "rating": "pg_13",
        "my_list_status": {
          "status": "completed",
          "score": 10,
          "num_episodes_watched": 1,
          "is_rewatching": false,
          "updated_at": "2025-10-17T22:39:09+00:00",
          "tags": [],
          "comments": ""
        }
      }
    },
    {
      "node": {
        "id": 12859,
        "title": "One Piece Film: Z",
        "main_picture": {
          "medium": "https://cdn.myanimelist.net/images/anime/6/44297.jpg",
          "large": "https://cdn.myanimelist.net/images/anime/6/44297l.jpg"
        },
        "alternative_titles": {
          "synonyms": ["One Piece Movie 12"],
          "en": "One Piece Film: Z",
          "ja": "ワンピース　フィルム　﻿Ｚ"
        },
        "start_date": "2012-12-15",
        "end_date": "2012-12-15",
        "synopsis": "The Straw Hat Pirates enter the rough seas of the New World in search of the hidden treasures of the Pirate King, Gol D. Roger－One Piece. On their voyage, the pirates come across a terrifying, powerful man, former Marine Admiral Z.\n\nZ is accused of having stolen the \"Dyna Stones\", weapons believed to have the power to shake up the New World. The Marine Headquarters believes Z is about to use it to end the pirate era, and with it, the lives of many innocent people. In fear of such a phenomenal event, marines start to take action against the former admiral.\n\nEven if it means stumbling upon marines and the navy, the Straw Hat Pirates decided to chase after Z and stop him from causing havoc. As they continue to embark on their ventures, the pirates bump into new and familiar acquaintances.",
        "mean": 8.1,
        "rank": 565,
        "popularity": 889,
        "num_episodes": 1,
        "status": "finished_airing",
        "genres": [
          {
            "id": 1,
            "name": "Action"
          },
          {
            "id": 2,
            "name": "Adventure"
          },
          {
            "id": 10,
            "name": "Fantasy"
          },
          {
            "id": 27,
            "name": "Shounen"
          }
        ],
        "media_type": "movie",
        "rating": "pg_13",
        "my_list_status": {
          "status": "completed",
          "score": 9,
          "num_episodes_watched": 1,
          "is_rewatching": false,
          "updated_at": "2025-01-04T06:27:19+00:00",
          "tags": [],
          "comments": ""
        }
      }
    },
    {
      "node": {
        "id": 38234,
        "title": "One Piece Movie 14: Stampede",
        "main_picture": {
          "medium": "https://cdn.myanimelist.net/images/anime/1221/100550.jpg",
          "large": "https://cdn.myanimelist.net/images/anime/1221/100550l.jpg"
        },
        "alternative_titles": {
          "synonyms": [],
          "en": "One Piece: Stampede",
          "ja": "劇場版『ONE PIECE STAMPEDE』（スタンピード）"
        },
        "start_date": "2019-08-09",
        "end_date": "2019-08-09",
        "synopsis": "Monkey D. Luffy and the Straw Hats arrive aboard the Sunny to the Pirates Festival, the world's largest celebration created by and for pirates. Buena Festa, the festival organizer, invites the Straw Hats and all Worst Generation crews to partake in the festivities. Luring even Shichibukai and Marines to its shores, it seems that no pirate or sailor can resist the enticing secrets that the event hides behind its glamor.\n\nThe festival's contest is simple: find one of the treasures Gol D. Roger left behind. As the competition progresses, the various pirate crews fight each other in a free-for-all battle royale—that is, until the sudden appearance of an unexpected pirate drastically changes the game.\n\n[Written by MAL Rewrite]\n",
        "mean": 8.18,
        "rank": 455,
        "popularity": 1265,
        "num_episodes": 1,
        "status": "finished_airing",
        "genres": [
          {
            "id": 1,
            "name": "Action"
          },
          {
            "id": 2,
            "name": "Adventure"
          },
          {
            "id": 10,
            "name": "Fantasy"
          },
          {
            "id": 27,
            "name": "Shounen"
          }
        ],
        "media_type": "movie",
        "rating": "pg_13",
        "my_list_status": {
          "status": "completed",
          "score": 9,
          "num_episodes_watched": 1,
          "is_rewatching": false,
          "updated_at": "2025-01-04T07:01:39+00:00",
          "tags": [],
          "comments": ""
        }
      }
    },
    {
      "node": {
        "id": 30276,
        "title": "One Punch Man",
        "main_picture": {
          "medium": "https://cdn.myanimelist.net/images/anime/12/76049.webp",
          "large": "https://cdn.myanimelist.net/images/anime/12/76049l.webp"
        },
        "alternative_titles": {
          "synonyms": ["One Punch-Man", "OPM"],
          "en": "One-Punch Man",
          "ja": "ワンパンマン"
        },
        "start_date": "2015-10-05",
        "end_date": "2015-12-21",
        "synopsis": "The seemingly unimpressive Saitama has a rather unique hobby: being a hero. In order to pursue his childhood dream, Saitama relentlessly trained for three years, losing all of his hair in the process. Now, Saitama is so powerful, he can defeat any enemy with just one punch. However, having no one capable of matching his strength has led Saitama to an unexpected problem—he is no longer able to enjoy the thrill of battling and has become quite bored.\n\nOne day, Saitama catches the attention of 19-year-old cyborg Genos, who witnesses his power and wishes to become Saitama's disciple. Genos proposes that the two join the Hero Association in order to become certified heroes that will be recognized for their positive contributions to society. Saitama, who is shocked that no one knows who he is, quickly agrees. Meeting new allies and taking on new foes, Saitama embarks on a new journey as a member of the Hero Association to experience the excitement of battle he once felt.\n\n[Written by MAL Rewrite]",
        "mean": 8.48,
        "rank": 167,
        "popularity": 4,
        "num_episodes": 12,
        "status": "finished_airing",
        "genres": [
          {
            "id": 1,
            "name": "Action"
          },
          {
            "id": 50,
            "name": "Adult Cast"
          },
          {
            "id": 4,
            "name": "Comedy"
          },
          {
            "id": 20,
            "name": "Parody"
          },
          {
            "id": 42,
            "name": "Seinen"
          },
          {
            "id": 31,
            "name": "Super Power"
          }
        ],
        "media_type": "tv",
        "rating": "r",
        "my_list_status": {
          "status": "completed",
          "score": 10,
          "num_episodes_watched": 12,
          "is_rewatching": false,
          "updated_at": "2025-01-04T06:50:00+00:00",
          "tags": [],
          "comments": ""
        }
      }
    },
    {
      "node": {
        "id": 33255,
        "title": "Saiki Kusuo no Ψ-nan",
        "main_picture": {
          "medium": "https://cdn.myanimelist.net/images/anime/1973/142750.jpg",
          "large": "https://cdn.myanimelist.net/images/anime/1973/142750l.jpg"
        },
        "alternative_titles": {
          "synonyms": ["Saiki Kusuo no Psi Nan", "Saiki Kusuo no Sainan"],
          "en": "The Disastrous Life of Saiki K.",
          "ja": "斉木楠雄のΨ難"
        },
        "start_date": "2016-07-04",
        "end_date": "2016-12-26",
        "synopsis": "To the average person, psychic abilities might seem a blessing; for Kusuo Saiki, however, this could not be further from the truth. Gifted with a wide assortment of supernatural abilities ranging from telepathy to x-ray vision, he finds this so-called blessing to be nothing but a curse. As all the inconveniences his powers cause constantly pile up, all Kusuo aims for is an ordinary, hassle-free life—a life where ignorance is bliss.\n\nUnfortunately, the life of a psychic is far from quiet. Though Kusuo tries to stay out of the spotlight by keeping his powers a secret from his classmates, he ends up inadvertently attracting the attention of many odd characters, such as the empty-headed Riki Nendou and the delusional Shun Kaidou. Forced to deal with the craziness of the people around him, Kusuo comes to learn that the ordinary life he has been striving for is a lot more difficult to achieve than expected.\n\n[Written by MAL Rewrite]",
        "mean": 8.41,
        "rank": 219,
        "popularity": 132,
        "num_episodes": 120,
        "status": "finished_airing",
        "genres": [
          {
            "id": 4,
            "name": "Comedy"
          },
          {
            "id": 57,
            "name": "Gag Humor"
          },
          {
            "id": 23,
            "name": "School"
          },
          {
            "id": 27,
            "name": "Shounen"
          },
          {
            "id": 31,
            "name": "Super Power"
          }
        ],
        "media_type": "tv",
        "rating": "pg_13",
        "my_list_status": {
          "status": "completed",
          "score": 9,
          "num_episodes_watched": 120,
          "is_rewatching": false,
          "updated_at": "2025-01-04T06:33:22+00:00",
          "tags": [],
          "comments": ""
        }
      }
    },
    {
      "node": {
        "id": 34612,
        "title": "Saiki Kusuo no Ψ-nan 2",
        "main_picture": {
          "medium": "https://cdn.myanimelist.net/images/anime/1961/91383.jpg",
          "large": "https://cdn.myanimelist.net/images/anime/1961/91383l.jpg"
        },
        "alternative_titles": {
          "synonyms": ["Saiki Kusuo no Psi Nan 2"],
          "en": "The Disastrous Life of Saiki K. 2",
          "ja": "斉木楠雄のΨ難 2"
        },
        "start_date": "2018-01-17",
        "end_date": "2018-06-27",
        "synopsis": "The disastrous life of the gifted psychic Kusuo Saiki continues, despite his utmost effort to live an ordinary life. Although he has certainly grown accustomed to dealing with his troublesome friends—who are his biggest hurdle to achieving a peaceful life—he still has a long way to go. Also joining the usual oddballs are a few new faces whose shenanigans add to Saiki's misery, making his dreams of a hassle-free life a distant fantasy.\n\n[Written by MAL Rewrite]",
        "mean": 8.41,
        "rank": 220,
        "popularity": 327,
        "num_episodes": 24,
        "status": "finished_airing",
        "genres": [
          {
            "id": 4,
            "name": "Comedy"
          },
          {
            "id": 57,
            "name": "Gag Humor"
          },
          {
            "id": 23,
            "name": "School"
          },
          {
            "id": 27,
            "name": "Shounen"
          },
          {
            "id": 31,
            "name": "Super Power"
          }
        ],
        "media_type": "tv",
        "rating": "pg_13",
        "my_list_status": {
          "status": "completed",
          "score": 9,
          "num_episodes_watched": 24,
          "is_rewatching": false,
          "updated_at": "2025-01-04T06:51:03+00:00",
          "tags": [],
          "comments": ""
        }
      }
    }
  ],
  "paging": {}
}
